Tekla.Structures.ModelInternal.ISharingCalls
The interface for Model Sharing API calls internal implementation. A feature should inject the implementation when ready to accept calls.

Tekla.Structures.ModelInternal.ISharingCalls.SharedModelStateChanged
Implements Tekla.Structures.Model.ISharingEvents.SharedModelStateChanged.

Tekla.Structures.ModelInternal.ISharingCalls.TestSharingOperationAsync(System.Boolean)
Implements Tekla.Structures.ModelInternal.Operation.TestSharingOperationAsync(System.Boolean).
showProgressDialog: If true, TS would show modal progress dialog, blocking UI interaction.
Returns: Awaitable task with the operation result.

Tekla.Structures.ModelInternal.ISharingCalls.InviteUserAsync(System.String,Tekla.Structures.Model.SharingRole,System.Boolean,System.String,System.Guid)
Implements Tekla.Structures.Model.ModelSharingHandler.InviteUserAsync(System.String,Tekla.Structures.Model.SharingRole,System.Boolean,System.String,System.Nullable{System.Guid}).
role: The user role.
userEmail: The user email.
sendEmail: If set, send an invitation email to the new user.
customEmailMessage: If non-empty, add the message to the invitation email.
modelId: If nonempty, the model id to invite user to. If empty, user is added to the currently opened model.
Returns: Awaitable task with the operation result.

Tekla.Structures.ModelInternal.ISharingCalls.GetModelsAsync
Implements Tekla.Structures.Model.ModelSharingHandler.GetModelsAsync.
Returns: Awaitable task with the operation result containing a collection of Tekla.Structures.ModelInternal.SharedModel.

Tekla.Structures.ModelInternal.ISharingCalls.StartSharingAsync(System.String,System.String,System.Guid)
Implements Tekla.Structures.Model.ModelSharingHandler.StartSharingAsync(System.String,System.String,System.Nullable{System.Guid}).
code: The sharing code for the model.
description: A description for the shared model. If empty, the default location is used.
location: The location of the shared model.
Returns:
An awaitable task that returns an Tekla.Structures.Model.ISharingResult`1 containing the unique identifier of the shared model.

Tekla.Structures.ModelInternal.ISharingCalls.GetLocationsAsync
Implements Tekla.Structures.Model.ModelSharingHandler.GetLocationsAsync.
Returns:
An awaitable task that returns a collection of location strings.

Tekla.Structures.ModelInternal.ISharingCalls.RemoveModelAsync(System.Guid)
Implements Tekla.Structures.Model.ModelSharingHandler.RemoveModelAsync(System.Guid).
modelId: The identifier of the model to be removed.
Returns: Awaitable task with the operation result.

Tekla.Structures.ModelInternal.ISharingCalls.GetUpdatesAsync(System.Guid)
Implements Tekla.Structures.Model.ModelSharingHandler.GetUpdatesAsync(System.Nullable{System.Guid}).
modelId: The unique identifier of the shared model.
Returns:
An awaitable task that returns a result containing the list of updates for the model.

Tekla.Structures.ModelInternal.ISharingCalls.JoinSharedModelAsync(System.Guid,System.String,System.Guid)
Implements Tekla.Structures.Model.ModelSharingHandler.JoinAsync(System.Guid,System.String,System.Nullable{System.Guid}).
modelId: The model identifier.
joinFolder: The folder to join to.
targetUpdateId: The update to join to. If empty, join to the latest update.
Returns: Awaitable task with the operation result.

Tekla.Structures.ModelInternal.ISharingCalls.ReadInAsync(System.Guid)
Implements Tekla.Structures.Model.ModelSharingHandler.ReadInAsync(System.Nullable{System.Guid}).
targetUpdate: The update to read in. If empty, reads in to the latest update.
Returns:
An awaitable task that returns an Tekla.Structures.ModelInternal.SharingResult indicating the result of the read-in operation.

Tekla.Structures.ModelInternal.ISharingCalls.WriteOutAsync(System.String,System.String,System.Boolean,System.String)
Implements Tekla.Structures.Model.ModelSharingHandler.WriteOutAsync(System.String,System.String,System.String) and Tekla.Structures.Model.ModelSharingHandler.CreateBaselineAsync(System.String,System.String,System.String).
Automatically release the next write-out reservation if there is one.
code: The code for the write-out operation.
comment: A comment describing the write-out.
fullPacket: If true, writes out a full packet. If false, writes out an incremental packet.
releaseNextWriteOutComment: A comment for releasing the next write-out reservation.Should not be empty when it's provided..
Returns:
An awaitable task that returns an Tekla.Structures.ModelInternal.SharingResult indicating the result of the write-out operation.

Tekla.Structures.ModelInternal.ISharingCalls.ReserveNextWriteOutAsync(System.String)
Implements Tekla.Structures.Model.ModelSharingHandler.ReserveNextWriteOutAsync(System.String).
comment: A comment describing the reservation.
Returns:
An awaitable task that returns an Tekla.Structures.ModelInternal.SharingResult indicating the result of the reserve operation.

Tekla.Structures.ModelInternal.ISharingCalls.ReleaseNextWriteOutAsync(System.String)
Implements Tekla.Structures.Model.ModelSharingHandler.ReleaseNextWriteOutAsync(System.String).
comment: A comment describing the release.
Returns:
An awaitable task that returns an Tekla.Structures.ModelInternal.SharingResult indicating the result of the release operation.

Tekla.Structures.ModelInternal.ISharingCalls.CloseProcess
Closes the Structures sharing process.